In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    'col1': [1,2,3,4,5],
    'col2': [45,56,67,34,34],
    'col3':"Abhishek Kumar Bablu Jack Nick".split()
})

In [7]:
df

   col1  col2      col3
0     1    45  Abhishek
1     2    56     Kumar
2     3    67     Bablu
3     4    34      Jack
4     5    34      Nick

In [8]:
df["col4"] = df.col1 * df.col1

In [9]:
df

   col1  col2      col3  col4
0     1    45  Abhishek     1
1     2    56     Kumar     4
2     3    67     Bablu     9
3     4    34      Jack    16
4     5    34      Nick    25

In [12]:
df["col5"] = df.col3.str[0]

In [13]:
df

   col1  col2      col3  col4 col5
0     1    45  Abhishek     1    A
1     2    56     Kumar     4    K
2     3    67     Bablu     9    B
3     4    34      Jack    16    J
4     5    34      Nick    25    N

In [14]:
def test(a):
    return a**2

In [15]:
df["col4_4"] = df["col1"].apply(test)

In [16]:
df

   col1  col2      col3  col4 col5  col4_4
0     1    45  Abhishek     1    A       1
1     2    56     Kumar     4    K       4
2     3    67     Bablu     9    B       9
3     4    34      Jack    16    J      16
4     5    34      Nick    25    N      25

In [17]:
df["col6_6"] = df["col5"].apply(lambda a : 's' if a == 's' else 'z')

In [18]:
df

   col1  col2      col3  col4 col5  col4_4 col6_6
0     1    45  Abhishek     1    A       1      z
1     2    56     Kumar     4    K       4      z
2     3    67     Bablu     9    B       9      z
3     4    34      Jack    16    J      16      z
4     5    34      Nick    25    N      25      z

In [19]:
df['col7'] = df['col3'].apply(len)

In [20]:
df

   col1  col2      col3  col4 col5  col4_4 col6_6  col7
0     1    45  Abhishek     1    A       1      z     8
1     2    56     Kumar     4    K       4      z     5
2     3    67     Bablu     9    B       9      z     5
3     4    34      Jack    16    J      16      z     4
4     5    34      Nick    25    N      25      z     4

In [22]:
import math

In [24]:
df['col8'] = df['col2'].apply(math.log)

In [25]:
df

   col1  col2      col3  col4 col5  col4_4 col6_6  col7      col8
0     1    45  Abhishek     1    A       1      z     8  3.806662
1     2    56     Kumar     4    K       4      z     5  4.025352
2     3    67     Bablu     9    B       9      z     5  4.204693
3     4    34      Jack    16    J      16      z     4  3.526361
4     5    34      Nick    25    N      25      z     4  3.526361

In [26]:
df["col_9"] = [i**2 for i in df.col8]

In [27]:
df

   col1  col2      col3  col4 col5  col4_4 col6_6  col7      col8      col_9
0     1    45  Abhishek     1    A       1      z     8  3.806662  14.490679
1     2    56     Kumar     4    K       4      z     5  4.025352  16.203456
2     3    67     Bablu     9    B       9      z     5  4.204693  17.679440
3     4    34      Jack    16    J      16      z     4  3.526361  12.435219
4     5    34      Nick    25    N      25      z     4  3.526361  12.435219

In [29]:
df["col_10"] = list(map(lambda a : a**2, df.col8))

In [30]:
df

,col1,col2,col3,col4,col5,col4_4,col6_6,col7,col8,col_9,col_10
0,1,45,Abhishek,1,A,1,z,8,3.806662,14.490679,14.490679
1,2,56,Kumar,4,K,4,z,5,4.025352,16.203456,16.203456
2,3,67,Bablu,9,B,9,z,5,4.204693,17.679440,17.679440
3,4,34,Jack,16,J,16,z,4,3.526361,12.435219,12.435219
4,5,34,Nick,25,N,25,z,4,3.526361,12.435219,12.435219

In [31]:
import numpy as np

In [32]:
l = ["Abhi", 1,2,3,4]

In [34]:
type(np.array(l))

numpy.ndarray

In [36]:
np.array([3,4,5,6,3.0])

array([3., 4., 5., 6., 3.])

In [39]:
a = np.array([[1,2], [3,4]])

In [40]:
a

array([[1, 2],
       [3, 4]])

In [41]:
a[1][1]

4

In [44]:
a = np.array([1,2,3,4], ndmin = 4)

In [48]:
a[0][0][0][0]

1

In [49]:
np.asanyarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [50]:
np.mat([1,2,3,4])

matrix([[1, 2, 3, 4]])

In [51]:
np.asanyarray(np.mat(a))

matrix([[1, 2, 3, 4]])

In [52]:
np.asanyarray(a)

array([[[[1, 2, 3, 4]]]])

In [53]:
np.fromfunction(lambda i, j : i ==j, (3,3))

array([[ True, False, False],
       [False,  True, False],
       [False, False,  True]])

In [59]:
(np.fromfunction(lambda i, j, z : i*j*z, (3,3,2), dtype = int))

array([[[0, 0],
        [0, 0],
        [0, 0]],

       [[0, 0],
        [0, 1],
        [0, 2]],

       [[0, 0],
        [0, 2],
        [0, 4]]])

In [60]:
np.fromfunction(lambda i, j, z, p : i*j*z*p, (4,3,3,2), dtype = int)

array([[[[ 0,  0],
         [ 0,  0],
         [ 0,  0]],

        [[ 0,  0],
         [ 0,  0],
         [ 0,  0]],

        [[ 0,  0],
         [ 0,  0],
         [ 0,  0]]],


       [[[ 0,  0],
         [ 0,  0],
         [ 0,  0]],

        [[ 0,  0],
         [ 0,  1],
         [ 0,  2]],

        [[ 0,  0],
         [ 0,  2],
         [ 0,  4]]],


       [[[ 0,  0],
         [ 0,  0],
         [ 0,  0]],

        [[ 0,  0],
         [ 0,  2],
         [ 0,  4]],

        [[ 0,  0],
         [ 0,  4],
         [ 0,  8]]],


       [[[ 0,  0],
         [ 0,  0],
         [ 0,  0]],

        [[ 0,  0],
         [ 0,  3],
         [ 0,  6]],

        [[ 0,  0],
         [ 0,  6],
         [ 0, 12]]]])

In [76]:
a = np.fromfunction(lambda i, j, z : i*j*z, (4,3,2), dtype = int)

In [77]:
a.reshape(3,8)

array([[0, 0, 0, 0, 0, 0, 0, 0],
       [0, 1, 0, 2, 0, 0, 0, 2],
       [0, 4, 0, 0, 0, 3, 0, 6]])

In [82]:
a.reshape(3,-1)

array([[0, 0, 0, 0, 0, 0, 0, 0],
       [0, 1, 0, 2, 0, 0, 0, 2],
       [0, 4, 0, 0, 0, 3, 0, 6]])

In [64]:
a.ndim

3

In [65]:
a.size

24

In [66]:
a.shape

(4, 3, 2)

In [67]:
a.dtype

dtype('int32')

In [69]:
a = np.fromfunction(lambda i, j : i*j, (4,3), dtype = int)

In [70]:
pd.DataFrame(a)

   0  1  2
0  0  0  0
1  0  1  2
2  0  2  4
3  0  3  6

In [71]:
np.random.rand(100, 4)

array([[0.29044664, 0.6465325 , 0.59746002, 0.42808992],
       [0.74351191, 0.83847512, 0.42554465, 0.27509966],
       [0.73412914, 0.62100592, 0.89116919, 0.62981587],
       [0.35600036, 0.09923121, 0.2235596 , 0.39003112],
       [0.37523878, 0.46859895, 0.21260613, 0.49525332],
       [0.44950145, 0.40161701, 0.88966637, 0.78549061],
       [0.39432126, 0.56248731, 0.91613726, 0.34242886],
       [0.10717064, 0.50442337, 0.05753632, 0.17891349],
       [0.25498846, 0.83266539, 0.27844321, 0.63750088],
       [0.85527415, 0.55488266, 0.68054161, 0.82370275],
       [0.93136814, 0.55599215, 0.95120693, 0.58062121],
       [0.34747083, 0.51806418, 0.38574016, 0.64088189],
       [0.64915165, 0.75873777, 0.09740154, 0.64538815],
       [0.75429615, 0.32978093, 0.97772025, 0.5894759 ],
       [0.45629183, 0.71404687, 0.55886962, 0.26705881],
       [0.83554623, 0.22034689, 0.05236685, 0.83880171],
       [0.52905797, 0.08784294, 0.09012902, 0.23447412],
       [0.92024218, 0.06521705, 0.59639062, 0.16145885],
       [0.96280259, 0.6139857 , 0.0592268 , 0.37982284],
       [0.87811248, 0.83279763, 0.17344071, 0.59621962],
       [0.95014699, 0.51984031, 0.84295246, 0.34427321],
       [0.5395534 , 0.55076831, 0.53461507, 0.42910794],
       [0.69978293, 0.43105627, 0.39391004, 0.71244244],
       [0.36035963, 0.4165391 , 0.73495557, 0.69261167],
       [0.48706814, 0.84609308, 0.75259631, 0.99615926],
       [0.54538915, 0.1901348 , 0.19792453, 0.12918273],
       [0.58740708, 0.76249908, 0.08072627, 0.44480118],
       [0.7320901 , 0.54799569, 0.36572125, 0.1599362 ],
       [0.52420943, 0.39364254, 0.44530088, 0.30438303],
       [0.57236831, 0.30537722, 0.01188953, 0.02100305],
       [0.40220359, 0.8655617 , 0.47659357, 0.67442337],
       [0.78832546, 0.88164683, 0.15192084, 0.79444489],
       [0.48063519, 0.22512545, 0.3206637 , 0.64691314],
       [0.01246588, 0.4189888 , 0.6372781 , 0.91718337],
       [0.25391527, 0.70938638, 0.99261745, 0.95213397],
       [0.00202236, 0.00271583, 0.39571896, 0.38842458],
       [0.73509475, 0.5431638 , 0.58941106, 0.60797594],
       [0.27317147, 0.39020215, 0.95401077, 0.19902463],
       [0.84816577, 0.95352845, 0.30934154, 0.56204929],
       [0.55615236, 0.65630679, 0.44083175, 0.24035893],
       [0.74744511, 0.16807855, 0.28697483, 0.28097609],
       [0.43014231, 0.58443292, 0.78797186, 0.73780596],
       [0.82833009, 0.40275325, 0.48899345, 0.43667263],
       [0.5907086 , 0.99828675, 0.97984457, 0.01344269],
       [0.00104961, 0.61806276, 0.18814542, 0.57252213],
       [0.00566536, 0.10864762, 0.12299888, 0.86356149],
       [0.58067864, 0.70685123, 0.55073285, 0.75202491],
       [0.09004178, 0.46489068, 0.35630163, 0.14444197],
       [0.73766283, 0.12141981, 0.78859225, 0.2210105 ],
       [0.27846595, 0.93502127, 0.37989225, 0.85664995],
       [0.4260708 , 0.12608649, 0.45216511, 0.84761131],
       [0.72334156, 0.45765754, 0.95783219, 0.28228514],
       [0.02491567, 0.60204291, 0.7918761 , 0.60975755],
       [0.05113505, 0.12290559, 0.40554064, 0.16918236],
       [0.48620133, 0.82363192, 0.91003637, 0.20582286],
       [0.71083564, 0.80374614, 0.22694955, 0.62566368],
       [0.30764978, 0.10450777, 0.84014849, 0.29446555],
       [0.31284977, 0.38703333, 0.25087585, 0.4644047 ],
       [0.92360537, 0.52020736, 0.36069649, 0.24994416],
       [0.81748603, 0.58625919, 0.08265375, 0.31641862],
       [0.70563116, 0.62940975, 0.32558571, 0.14895038],
       [0.00329827, 0.31050016, 0.74529742, 0.47618956],
       [0.34362597, 0.03792359, 0.8744313 , 0.45902095],
       [0.67000544, 0.40192117, 0.72983445, 0.64328083],
       [0.4319315 , 0.64035012, 0.29960843, 0.27329975],
       [0.95647272, 0.93404817, 0.1232973 , 0.08499627],
       [0.78006804, 0.94049176, 0.67520995, 0.84686769],
       [0.70366989, 0.72835643, 0.96928679, 0.69034281],
       [0.45642094, 0.35539932, 0.8036179 , 0.14904409],
       [0.13661623, 0.72712429, 0.21807682, 0.4570444 ],
       [0.80171092, 0.95642538, 0.39914552, 0.85823707],
       [0.32835911, 0.09718829, 0.32317963, 0.34737524],
       [0.1936906 , 0.38815623, 0.35305638, 0.94885118],
       [0.86072157, 0.06523194, 0.64941295, 0.93974594],
       [0.19177314, 0.80856663, 0.49895143, 0.04994329],
       [0.33267212, 0.24735388, 0.18170105, 0.79210328],
       [0.57870474, 0.90723781, 0.19387232, 0.03376622],
       [0.39928801, 0.14997413, 0.33719437, 0.32201259],
       [0.11222538, 0.77695774, 0.85180756, 0.1553522 ],
       [0.60172361, 0.61154222, 0.51739382, 0.29632655],
       [0.56844592, 0.61834112, 0.26708411, 0.32726074],
       [0.00511521, 0.46532462, 0.35603407, 0.23668205],
       [0.16723809, 0.61762283, 0.04357518, 0.33412359],
       [0.15288977, 0.82017609, 0.35672146, 0.65303116],
       [0.03607597, 0.69748303, 0.14821623, 0.96657773],
       [0.7099205 , 0.62154785, 0.48919308, 0.39678341],
       [0.61114629, 0.75929604, 0.16379235, 0.11517838],
       [0.3689392 , 0.79550253, 0.48589264, 0.59375043],
       [0.54175548, 0.99531227, 0.80642429, 0.72560781],
       [0.94338389, 0.75683885, 0.40924337, 0.06427033],
       [0.15720202, 0.48851256, 0.95851935, 0.142495  ],
       [0.70828982, 0.45702463, 0.81751066, 0.03260006],
       [0.47932901, 0.46762909, 0.35873935, 0.97715476],
       [0.27808141, 0.51924544, 0.90060218, 0.06892435],
       [0.73695029, 0.97593603, 0.3532222 , 0.6361212 ],
       [0.76613599, 0.91947076, 0.33409686, 0.64248546],
       [0.78714092, 0.84305022, 0.5179016 , 0.41022265],
       [0.39793287, 0.98098363, 0.31135208, 0.08808622],
       [0.31245048, 0.21356103, 0.699731  , 0.93797543],
       [0.72651356, 0.20914349, 0.34483256, 0.02569489]])

In [73]:
np.random.randint(4,50)

26

In [74]:
np.random.randn(4,5)

array([[-0.12062521, -0.73930471,  1.47230303, -0.20177108,  1.34977866],
       [ 1.1984009 , -0.27337058,  1.08665872,  0.86335124,  0.34936973],
       [ 0.10119261, -0.42562812, -0.11003527, -0.07165053,  0.7171724 ],
       [ 0.31390027,  0.40741077,  0.11353099,  1.10784389,  0.02587471]])

In [75]:
pd.DataFrame(np.random.randn(4,5))

          0         1         2         3         4
0 -0.950458  0.329538 -0.003609 -0.277984 -0.411856
1 -0.750503  0.665443 -0.637305  0.142859 -0.271625
2  1.421488  0.955253  0.681413  1.932530  0.149864
3  1.344453 -0.571256  0.429407 -0.287517  0.484030

In [84]:
a1 = np.arange(4,10,.2)

In [85]:
a1

array([4. , 4.2, 4.4, 4.6, 4.8, 5. , 5.2, 5.4, 5.6, 5.8, 6. , 6.2, 6.4,
       6.6, 6.8, 7. , 7.2, 7.4, 7.6, 7.8, 8. , 8.2, 8.4, 8.6, 8.8, 9. ,
       9.2, 9.4, 9.6, 9.8])

In [86]:
a1[1:4]

array([4.2, 4.4, 4.6])

In [88]:
arr = np.random.rand(4, 5)

In [90]:
arr

array([[0.34011707, 0.76321887, 0.46959978, 0.96842855, 0.94926278],
       [0.00578079, 0.11008426, 0.97456154, 0.25350418, 0.37955959],
       [0.47534932, 0.93694308, 0.25583818, 0.58251287, 0.6674287 ],
       [0.84622084, 0.07690218, 0.84918105, 0.92705247, 0.70841282]])

In [91]:
arr> .5

array([[False,  True, False,  True,  True],
       [False, False,  True, False, False],
       [False,  True, False,  True,  True],
       [ True, False,  True,  True,  True]])

In [93]:
arr[arr > .5]

array([0.76321887, 0.96842855, 0.94926278, 0.97456154, 0.93694308,
       0.58251287, 0.6674287 , 0.84622084, 0.84918105, 0.92705247,
       0.70841282])

In [94]:
arr[[1,2], [2]]

array([0.97456154, 0.25583818])

In [95]:
arr = np.random.rand(8, 5)

In [96]:
arr[1:8, [0,1,2]]

array([[0.61918031, 0.87394225, 0.70802798],
       [0.97234119, 0.04109977, 0.51181196],
       [0.94974209, 0.23466926, 0.80707858],
       [0.51561936, 0.30381498, 0.35259447],
       [0.46321336, 0.20728387, 0.22678734],
       [0.83655565, 0.46821719, 0.64324384],
       [0.32979151, 0.57534815, 0.92997747]])

In [101]:
a = np.array([[1,2],[3,4]])

In [102]:
b = np.array([[1,5],[3,5]])

In [104]:
m = a@b

In [105]:
m/0

C:\Users\win\AppData\Local\Temp/ipykernel_15920/3791875896.py:1: RuntimeWarning: divide by zero encountered in true_divide
  m/0

array([[inf, inf],
       [inf, inf]])